app/controllers/data_collection_controller.rb

INSERT INTO "soilmoistures" ("collection_point_id", "collection_time", "created_at", "deptha", "depthb", "depthc", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def submit
        if params[:type] == 'soilmoisture'
            data = Soilmoisture.new(params[:data])
            data.save!