app/controllers/home_controller.rb

SELECT "sites".* FROM "sites"
---
  def index
      @sites = Site.all