app/controllers/sites_controller.rb

SELECT "sites".* FROM "sites" WHERE "sites"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "node_readings".* FROM "node_readings" WHERE "node_readings"."node_id" IN (1) ORDER BY collection_time DESC
SELECT "nodes".* FROM "nodes" WHERE "nodes"."site_id" = 1
---
    def show
        @site = Site.find(params[:id])
        @nodes = @site.nodes.includes(:readings)